# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv10n object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov10
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]


#InvertedBlock[c2, expand_ratio = t, stride = s]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, InvertedBlock, [64, 1, 1]] # 1-P2/4 | -- 1st block
  - [-1, 1, InvertedBlock, [64, 6, 2]] # 2        #| -- 2nd block
  - [-1, 1, InvertedBlock, [64, 6, 1]] # 3        #| --
  - [-1, 1, InvertedBlock, [128, 6, 2]] # 4      #| -- 3rd block
  - [-1, 1, InvertedBlock, [128, 6, 1]] # 5      #| --
  - [-1, 1, InvertedBlock, [128, 6, 1]] # 6      #| --
  - [-1, 1, InvertedBlock, [256, 6, 2]] # 7      #| -- 4th block
  - [-1, 1, InvertedBlock, [256, 6, 1]] # 8      #| --
  - [-1, 1, InvertedBlock, [256, 6, 1]] # 9      #| --
  - [-1, 1, InvertedBlock, [256, 6, 1]] # 10      #| --
  - [-1, 1, InvertedBlock, [512, 6, 1]] # 11       #| -- 5th block
  - [-1, 1, InvertedBlock, [512, 6, 1]] # 12
  - [-1, 1, InvertedBlock, [512, 6, 1]] # 13
  - [-1, 1, InvertedBlock, [512, 6, 2]] # 14       #| -- 6th block
  - [-1, 1, InvertedBlock, [512, 6, 1]] # 15
  - [-1, 1, InvertedBlock, [512, 6, 1]] # 16
  - [-1, 1, InvertedBlock, [1024, 6, 1]] # 17      #| -- 7th block final
  - [-1, 1, Conv, [1024, 1, 1]] #18 # 3-P3/8
  - [-1, 1, SPPF, [1024, 5]] # 19 # 9
  - [-1, 1, PSA, [1024]] #20  # 10

# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 21
  - [[-1, 13], 1, Concat, [1]] # 22 # cat backbone P4
  - [-1, 3, C2f, [512]] #23 # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [[-1, 6], 1, Concat, [1]] # 25 # cat backbone P3
  - [-1, 3, C2f, [256]] #26 # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 27
  - [[-1, 23], 1, Concat, [1]] #28 # cat head P4
  - [-1, 3, C2f, [512]] #29 # 19 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]] #30
  - [[-1, 20], 1, Concat, [1]] #31 # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] #32  # 22 (P5/32-large)

  - [[26, 29, 32], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
